<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>C++</title>
                    
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
</head>
  <body bgcolor="#99ff99" text="#000000" link="#0000ee" alink="#0000ee"
 vlink="#551a8b">
     
<div align="center">
<div align="center"><big><big><big><big><b>C++</b></big></big></big></big><br>
<big><big><big><big><b>   </b></big></big></big></big><br>
<big>C++ (pronun&#539;at ca &icirc;n englez&#259; /&#712;si&#720; pl&#652;s pl&#652;s/ ) este un limbaj
de programare general, compilat. Este un limbaj multi-paradigm&#259;, cu verificarea
static&#259; a tipului variabilelor ce suport&#259; programare procedural&#259;, abstractizare
a datelor, programare orientat&#259; pe obiecte. &Icirc;n anii 1990, C++ a devenit
unul dintre cele mai populare limbaje de programare comerciale, r&#259;m&acirc;n&acirc;nd
astfel p&acirc;n&#259; azi[1].<br>
<br>
Bjarne Stroustrup de la Bell Labs a dezvoltat C++ (ini&#539;ial denumit C cu clase)
&icirc;n anii 1980, ca o serie de &icirc;mbun&#259;t&#259;&#539;iri ale limbajului C. Acestea
au &icirc;nceput cu ad&#259;ugarea no&#539;iunii de clase, apoi de func&#539;ii virtuale,
suprascrierea operatorilor, mo&#537;tenire multipl&#259;, &#537;abloane (englez&#259; template)
&#537;i excep&#539;ii. Limbajul de programare C++ a fost standardizat &icirc;n 1998
ca &#537;i ISO 14882:1998, versiunea curent&#259; fiind din 2003, ISO 14882:2003. Urm&#259;toarea
versiune standard, cunoscut&#259; informal ca C++0x, este &icirc;n lucru.<br>
Stroustrup a &icirc;nceput s&#259; lucreze la C cu clase &icirc;n 1979. Ideea
cre&#259;rii unui nou limbaj a venit din experien&#539;a de programare pentru preg&#259;tirea
tezei sale de doctorat. Stroustrup a descoperit c&#259; Simula avea facilit&#259;&#539;i
foarte utile pentru proiecte mari, &icirc;ns&#259; era prea lent, &icirc;n timp
ce BCPL era rapid, &icirc;ns&#259; nu era de nivel &icirc;nalt &#537;i era nepotrivit
pentru proiecte mari. C&acirc;nd a &icirc;nceput s&#259; lucreze pentru Bell Labs,
avea sarcina de a analiza nucleul UNIX referitor la calcul distribuit. Amintindu-&#537;i
de experien&#539;a sa din perioada lucr&#259;rii de doctorat, Stroustrup a &icirc;nceput
s&#259; &icirc;mbun&#259;t&#259;&#539;easc&#259; C cu facilit&#259;&#539;i asem&#259;n&#259;toare Simula. C a fost ales
deoarece era rapid &#537;i portabil. La &icirc;nceput facilit&#259;&#539;ile adaugate C-ului
au fost clase, clase derivate, verificare a tipului, inline &#537;i argumente
cu valori implicite. &Icirc;n timp ce Stroustrup a proiectat C cu clase (mai
apoi C++), a scris de asemenea &#537;i Cfront, un compilator care genera cod surs&#259;
C din cod C cu clase. Prima lansare comercial&#259; a fost &icirc;n 1985.<br>
&Icirc;n 1982, numele limbajului a fost schimbat de la C cu clase la C++.
Au fost adaugate noi facilit&#259;&#539;i, inclusiv func&#539;ii virtuale, supra&icirc;nc&#259;rcarea
operatorilor &#537;i a functiilor, referin&#539;e, constante, alocare dinamic&#259;, un
control al tipului mai puternic &#537;i noua variant&#259; de comentariu pe un singur
r&acirc;nd (liniile care &icirc;ncep cu caracterele '//').<br>
<br>
&Icirc;n 1985 a fost lansat&#259; prima edi&#539;ie a c&#259;r&#539;ii "The C++ Programming Language"
(Limbajul de programare C++), oferind informa&#539;ii importante despre limbaj,
care &icirc;nc&#259; nu era un standard oficial. &Icirc;n 1989 a fost lansat&#259;
versiunea 2.0 a C++. Au ap&#259;rut acum mo&#537;tenirea multipl&#259;, clase abstracte,
func&#539;ii statice, func&#539;ii constante &#537;i membri protected. &Icirc;n 1990 o alt&#259;
carte a fost lansat&#259;, oferind suport pentru standarde viitoare. Ultimele
ad&#259;ug&#259;ri includeau template-uri, excep&#539;ii, spa&#539;ii de nume (namespace-uri)
&#537;i tipul boolean.<br>
<br>
O dat&#259; cu evolu&#539;ia limbajului C++, a evoluat &#537;i o bibliotec&#259; standard. Prima
ad&#259;ugire a fost biblioteca de intr&#259;ri/ie&#537;iri (I/O stream), care oferea facilit&#259;&#539;i
pentru a &icirc;nlocui func&#539;iile tradi&#539;ionale C cum ar fi printf &#537;i scanf.
Mai t&acirc;rziu, printre cele mai semnificative ad&#259;ugari la biblioteca standard
a fost STL (Standard Template Library) (Biblioteca de formate standard).<br>
<br>
Dup&#259; ani de lucru, un comitet ANSI-ISO a standardizat C++ &icirc;n 1998 (ISO/IEC
14882:1998).<br>
<big><big><big><big><b>   </b></big></big></big></big></big></div>
   
<div align="justify"><br>
     
<div align="justify"><br>
   <big><big><br>
   </big></big><br>
   <br>
   <a href="dreapta.html"><img src="back.jpg" alt="back" width="100"
 height="76">
   </a><br>
   <br>
   </div>
   </div>
   </div>
   <br>
  <br>
 <br>
</body>
</html>
